IdeaRS.Connections
MemberCutBeamData Class
Compatible with IDEA StatiCa 0.0
 Data for Cut of stiffening member positioned on Steel member
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.ConnectionCmdData
 IdeaRS.Connections.Data.CutBeamByBeamData
 IdeaRS.Connections.Data.CutBeamData
 IdeaRS.Connections.Data.MemberCutBeamData
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class MemberCutBeamData : CutBeamData
The MemberCutBeamData type exposes the following members.
Constructors
Name | Description
MemberCutBeamData
Initializes a new instance of the MemberCutBeamData class
Top
Properties
Name | Description
CutPartOnMem1
 Cut off part on member 1
 (Inherited from CutBeamData.)
CutPartOnMem2
 Cut off part on member 2
 (Inherited from CutBeamData.)
CuttingObjectPath
 Gets or sets the cutting plane
 (Inherited from CutBeamByBeamData.)
ExtendToPlane
 If true object is extended to the cutting plane
 (Inherited from CutBeamByBeamData.)
FlangesWeld
 Gets or sets the properties of the weld - flanges
 (Inherited from CutBeamByBeamData.)
IsActive |  (Inherited from ConnectionCmdData.)
IsWeld
 If true welds are generated automatically
 (Inherited from CutBeamByBeamData.)
KeptPartCode
 Gets or sets the code of the part which should be kept in the model after cutting. 0 - end 1 - begin
 (Inherited from CutBeamByBeamData.)
Method
 The type
 (Inherited from CutBeamByBeamData.)
ModifiedObjectPath
 Gets or sets the object to cut
 (Inherited from CutBeamByBeamData.)
Name
 Gets or set the name
 (Inherited from ConnectionCmdData.)
Offset
 Gets or sets the offset of the cut - relative to cutting plane
 (Inherited from CutBeamByBeamData.)
OperationId
 Gets or sets the identifier of the operation in the manufacturer sequence
 (Inherited from ConnectionCmdData.)
Orientation
 Gets or sets the orientation of the cut
 (Inherited from CutBeamByBeamData.)
PlaneOnCuttingObject
 Gets or sets the distance of the cutting plane relative to the beginning of the modified beam
 (Inherited from CutBeamByBeamData.)
Weld
 Gets or sets the properties of the weld - other parts
 (Inherited from CutBeamByBeamData.)
Top
Methods
Name | Description
Equals
Determines whether the specified object is equal to the current object.
 (Inherited from Object.)
Finalize
Allows an object to try to free resources and perform other cleanup operations before it is reclaimed by garbage collection.
 (Inherited from Object.)
GetHashCode
Serves as the default hash function.
 (Inherited from Object.)
GetShallowCopy |  (Inherited from ConnectionCmdData.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
MemberwiseClone
Creates a shallow copy of the current Object.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Top
See Also
Reference
IdeaRS.Connections.Data Namespace